-- 2016年假日表
/*
一、元旦：1月1日放假，与周末连休。
二、春节：2月7日至13日放假调休，共7天。2月6日（星期六）、2月14日（星期日）上班。
三、清明节：4月4日放假，与周末连休。
四、劳动节：5月1日放假，5月2日（星期一）补休。
五、端午节：6月9日至11日放假调休，共3天。6月12日（星期日）上班。
六、中秋节：9月15日至17日放假调休，共3天。9月18日（星期日）上班。
七、国庆节：10月1日至7日放假调休，共7天。10月8日（星期六）、10月9日（星期日）上班。
 */
update tb_work_holiday set daytype = 2
where 
   daytime_str between '2016-01-01' and '2016-01-01'    -- 元旦
or daytime_str between '2016-02-07' and '2016-02-13'    -- 春节
or daytime_str between '2016-04-04' and '2016-04-04'    -- 清明节
or daytime_str between '2016-05-01' and '2016-05-02'    -- 劳动节 
or daytime_str between '2016-06-09' and '2016-06-11'    -- 端午节 
or daytime_str between '2016-09-15' and '2016-09-17'    -- 中秋节
or daytime_str between '2016-10-01' and '2016-10-07';   -- 国庆节
-- 更新调班
update tb_work_holiday set daytype = 0
where daytime_str in (
'2016-02-06','2016-02-14',                              -- 春节调班
'2016-06-12',                                           -- 端午节调班
'2016-09-18',                                           -- 中秋节调班
'2016-10-08','2016-10-09');                             -- 国庆节调班