-- 2011年假日表
/*
一、元旦：1月1日至3日放假公休，共3天。
二、春节：2月2日（农历除夕）至8日放假调休，共7天。1月30日（星期日）、2月12日（星期六）上班。
三、清明节：4月3日至5日放假调休，共3天。4月2日（星期六）上班。
四、劳动节：4月30日至5月2日放假公休，共3天。
五、端午节：6月4日至6日放假公休，共3天。
六、中秋节：9月10日至12日放假公休，共3天。
七、国庆节：10月1日至7日放假调休，共7天。10月8日（星期六）、10月9日（星期日）上班。
 */
update tb_work_holiday set daytype = 2
where  
   daytime_str between '2011-01-01' and '2011-01-03'    -- 元旦
or daytime_str between '2011-02-02' and '2011-02-08'    -- 春节
or daytime_str between '2011-04-03' and '2011-04-05'    -- 清明节   
or daytime_str between '2011-04-30' and '2011-05-02'    -- 劳动节
or daytime_str between '2011-06-04' and '2011-06-06'    -- 端午节
or daytime_str between '2011-09-10' and '2011-09-12'    -- 中秋节
or daytime_str between '2011-10-01' and '2011-10-07';   -- 国庆节
-- 更新调班
update tb_work_holiday set daytype = 0
where daytime_str in (
'2011-01-30','2011-02-12',                              -- 春节调班
'2011-04-02',                                           -- 清明节调班
'2011-10-08','2011-10-09');                             -- 国庆节调班