-- 2025年假日表 
/*
全体公民放假的节日：

1.元旦，放假1天（1月1日）；
2.春节，放假4天（农历除夕、正月初一至初三）；
3.清明节，放假1天（农历清明当日）；
4.劳动节，放假2天（5月1日、2日）；
5.端午节，放假1天（农历端午当日）；
6.中秋节，放假1天（农历中秋当日）；
7.国庆节，放假3天（10月1日至3日）。
如果适逢周六、周日，应当在工作日补假。

全体公民放假的假日，可合理安排统一放假调休，结合落实带薪年休假等制度，实际形成较长假期。除个别特殊情形外，法定节假日假期前后连续工作一般不超过6天。
*/
update tb_work_holiday set daytype = 2
where 
   daytime_str between '2025-01-01' and '2025-01-01'   -- 元旦
or daytime_str between '2025-01-28' and '2025-02-04'   -- 春节
or daytime_str between '2025-04-04' and '2025-04-06'   -- 清明节
or daytime_str between '2025-05-01' and '2025-05-05'   -- 劳动节
or daytime_str between '2025-05-31' and '2025-06-02'   -- 端午节
or daytime_str between '2025-10-01' and '2025-10-08';  -- 国庆节、中秋节
-- 更新调班
update tb_work_holiday set daytype = 0
where daytime_str in (
'2025-01-25','2025-02-08',                             -- 春节调班
'2025-04-27',                                          -- 劳动节调班
'2025-09-28','2025-10-11');                            -- 国庆节、中秋节调班